/*

В България стотинките са с номинална стойност 1, 2, 5, 10, 20 и 50.
Да се състави програма, която по въведена сума [10..999] извежда
възможно най-малък брой монети/стотинки, с които може да се плати.

Вход: От стандартния вход се въвежда естествено число N (10 <= N <= 999).
Изход: На стандартния изход се извежда минималния брой монети.

Пример #1
	Вход
		88

	Изход
		6


	50 стотинки - 1 бр.
	20 стотинки - 1 бр.
	10 стотинки - 1 бр.
	5 стотинки - 1 бр.
	2 стотинки - 1 бр.
	1 стотинкa - 1 бр.

*/

#include <iostream>
using namespace std;

int num, sum;

void solve(){

   	int moneti[6]={50,20,10,5,2,1};

	for (int i = 0; i < 6; i++){
		if (sum >= moneti [i]){
			num += sum / moneti[i];
			sum = sum % moneti [i];
		}
	}
}

int main(){

	cin >> sum;
	solve();
	cout << num << endl;

	return 0;
}

/*

Допълнителни въпроси:
1. Ако сменим монетите с 25,10,4 ще се промени ли нещо?
2. Кога алгоритъма няма да работи?

*/