/*

Дадени са N предмета, i-тият от тях струва ci лева и тежи ai килограма.
Дадените числа са цели и положителни. Разполагаме с раница, в която могат да се
сложат предметите, но не винаги всичките заедно, защото капацитетът на раницата
не позволява общото тегло на поставените в нея предмети да надхвърля дадено цяло
число М. Кои от предметите да изберем за да раницата, така че сумата от стойностите
им да е възможно най-голяма?

*/

#include <iostream>
using namespace std;

int n, m;
int c[1024], a[1024], z[1024][1024], w[1024][1024], y[1024][256][1024];

void read(){
	cin >> n;
	for(int i = 0; i < n; i++)
		cin >> c[i] >> a[i];

	cin >> m;
}

void solve(){
	int k,t,i,v1,v2,t0;
	k = 1;
	for(t = 0; t <= m; t++){
		z[k][t] = (a[k] <= t) ? c[k] : 0;
		w[k][t] = (a[k] <= t) ? a[k] : 0;
		y[k][t][k] = (a[k] <= t) ? 1 : 0;
	}

	for(k = 2; k <= n; k++)
		for(t = 0; t <= m; t++){
			v1 = z[k-1][t];
			t0 = t - a[k];
			if(t0 < 0) t0 = 0;
			v2 = c[k] + z[k-1][t0];
			if((v1 < v2) && (a[k] + w[k-1][t0] <= t)){
				z[k][t] = v2;
				w[k][t] = w[k-1][t0] + a[k];
				for(i = 1; i < k; i++)
					y[k][t][i] = y[k-1][t0][i];
				y[k][t][k] = i;
			}
			else{
				z[k][t] = v1;
				w[k][t] = w[k-1][t];
				for(i = 1; i< k; i++)
					y[k][t][i] = y[k-1][t][i];
			}
		}
}

int main(){

	read();
	solve();
	cout << z[n][m] << endl;
	return 0;
}